import java.util.Scanner;
import java.io.PrintStream;
public class Main {
    public static Scanner in = new Scanner(System.in);
    public static PrintStream out = System.out;
    public static void main(String[] args) {
        Scanner in = new Scanner(System.in);
        int x = in.nextInt(); // кол-во воды всего
        int a = in.nextInt(); // объем первой ванночки
        int b = in.nextInt(); // объем второй ванночки
        int c = in.nextInt(); // объем третьей ванночки
        int d = in.nextInt(); // объем четвертой ванночки

        int k = 0; // кол-во полностью заполненных ванночек
        String r = ""; // номера заполненных ванночек

        // проверяем, заполнится ли ванна А
        if (x >= a){
            k += 1; // увеличиваем кол-во заполненных ванн
            r = "A"; // добавляем название этой ванны
            x = x - a; // вычитаем из всего объема объем a
            // проверяем, заполнится ли ванна В
            if (x >= b){
                k += 1; // увеличиваем кол-во заполненных ванн
                r = "A B"; // добавляем название этой ванны
                x = x - b; // вычитаем из оставшегося объема объем b
                // проверяем, заполнится ли ванна C
                if (x >= c){
                    k+= 1; // увеличиваем кол-во заполненных ванн
                    r = "A B C"; // добавляем название этой ванны
                    x = x - c; // вычитаем из оставшегося объема объем c
                    // проверяем, заполнится ли ванна D
                    if (x >= d){
                        k += 1; // увеличиваем кол-во заполненных ванн
                        r = "A B C D"; // добавляем название этой ванны
                    }
                }
            }
        }
        out.println(k); // выводим кол-во заполненных ванн
        // проверяем, есть ли заволненные ванны
        if (k == 0){
            out.println("Ни одна ванна не заполнилась"); // если таких нет, то выводим, что ни одна ванна не заполнилась
        } else{
            out.println(r); // выводим названия заполненных ванн, если они есть
        }
    }
}
